
function fact(){
	let fact = [
  {
    image: '../static/images/fact/uosho.webp',
    text: 'Шимпанзе по имени Уошо стала одной из первых обезьян, освоивших язык жестов, и смогла выучить более сотни знаков для общения с людьми. Уошо любила играть с куклами, устраивать воображаемые чаепития и чистить зубы, как человек.'
  },
  {
	 image: '../static/images/fact/mirorr.webp',
	 text: 'Шимпанзе способны узнавать себя в зеркале, а такая способность встречается лишь у немногих животных.'
  },
  {
   image: '../static/images/fact/ham.jpg',
   text: 'Шимпанзе Хэм стал первым шимпанзе, побывавшим в космосе, и его успешный полёт помог подготовить отправку первых американских астронавтов. После возвращения из космоса он прожил ещё более двадцати лет и стал одной из самых известных обезьян в истории.'
  },
  {
  image: '../static/images/fact/cryst.png',
  text: 'Капуцин Кристал снялась в десятках фильмов и сериалов и считается одной из самых успешных обезьян-актёров Голливуда. Она сыграла обезьяну Декстера в серии фильмов «Ночь в музее», снималась вместе с известными актёрами, включая Бена Стиллера и Робина Уильямса.'
  },
  {
	image: '../static/images/fact/panch.webp',
	 text: 'Японская макака Панч стала известна во всём мире благодаря своей дружбе с плюшевым орангутаном, которого сотрудники зоопарка дали ему после того, как мать отказалась от него вскоре после рождения. Сначала Панчу было трудно находить общий язык с другими обезьянами, и он постоянно искал утешение у своей игрушки. Однако со временем японская макака Панч начала всё чаще играть с другими макаками, получила друзей среди взрослых обезьян и стала гораздо увереннее чувствовать себя в группе. Сейчас Панч продолжает жить в зоопарке Итикава в Японии, постепенно становясь самостоятельнее и всё реже нуждаясь в своём плюшевом друге, хотя игрушка по-прежнему остаётся рядом с ним.'
  },
  {
	 image: '../static/images/fact/babblz.webp',
	 text: 'Шимпанзе Бабблз был любимым питомцем Майкла Джексона и сопровождал его во многих поездках и публичных мероприятиях. Бабблз жил в особняке Майкла Джексона и спал в отдельной комнате.'
  },
  {
	 image: '../static/images/fact/susie.webp',
	 text: 'Сьюзи — шимпанзе, которая в 1951 году была доставлена в японский зоопарк Уэно. Трёхлетняя обезьяна быстро научилась акробатическим трюкам, езде на велосипеде и игре на пианино. Она несколько раз выступала в театре под открытым небом и стала любимицей публики. В 1956 году зоопарк посетил император Хирохито. Сьюзи прокатилась перед ним на велосипеде, а затем неожиданно подошла к монарху и протянула ему руку. Император ответил на рукопожатие, и этот момент стал знаменитым благодаря фотографиям в мировых газетах. Вскоре после этого случая Сьюзи вышла на пенсию из-за проблем со здоровьем'
  },
  {
	 image: '../static/images/fact/gabina_persey.webp',
	 text: 'Белорукие гиббоны живут в Ленинградском зоопарке уже более 50 лет, а одной из самых известных семей является пара Габины и Персея. Эти гиббоны прославились не только крепкими семейными отношениями, но и тем, что стали родителями нескольких детёнышей, включая малыша, родившегося в 2026 году. Габина и Персей регулярно удивляют сотрудников своей сообразительностью: например, однажды Габина решила сложную головоломку с фруктами, просто наклонив её так, чтобы все лакомства скатились в одно место. Семья гиббонов также известна своими громкими дуэтами, которые посетители могут услышать в павильоне приматов. Для поддержания активности и развития интеллекта сотрудники зоопарка регулярно придумывают для гиббонов новые игрушки, задания и головоломки, с которыми они успешно справляются.'
  },
  {
	 image: '../static/images/fact/batat.webp',
	 text: 'Японские макаки известны своей способностью к обучению. В 1950 году на острове Косима исследователи из Токийского университета начали давать макакам сладкий картофель — батат, раскидывая его на земле. К 1952 году обезьяны начали его активно есть. Животным нравился батат, но не нравился песок, который к нему прилипал. В 1953 году полуторагодовалая самка по имени Имо перед тем, как съесть батат, вымыла его от грязи в реке. С этого момента она начала так делать всегда. Первыми последовали её примеру мать и сестра, а к 1959 году 15 из 19 молодых обезьян, обитавших на острове, и 2 из 11 взрослых уже мыли батат. К январю 1962 года почти все обезьяны в колонии мыли картофель перед едой.'
  },
  {
	 image: '../static/images/fact/limba.webp',
	 text: 'Королевский колобус Лимба стал известен благодаря участию в программе сохранения редкого вида в Великобритании. Вместе с другими колобусами он помог привлечь внимание посетителей зоопарка к исчезновению этих необычных обезьян, которые рождаются полностью белыми и лишь спустя несколько месяцев приобретают свою знаменитую чёрно-белую окраску.'
  },
  {
	 image: '../static/images/fact/palec.webp',
	 text: 'У колобусов редуцирован большой палец на лапах — вместо него лишь небольшой отросток. Это позволяет им лучше держаться на ветвях и приспосабливаться к жизни на деревьях. Название «колобус» происходит от греческого слова, означающего «увечный» или «искалеченный». '
  },
  {
	  image: '../static/images/fact/group.webp',
	 text: 'Капуцины способны очень быстро перенимать новые поведенческие привычки, и если одна особь находит эффективный способ добычи пищи, он может распространиться на всю группу.'
  },
  {
	  image: '../static/images/fact/prygun.jpg',
	 text: 'В моменты опасности чернолобые прыгуны могут часами оставаться почти неподвижными, снижая риск быть замеченными хищниками в густой листве.'
  },
  {
	  image: '../static/images/fact/tail.jpg',
	 text: 'Чернолобые прыгуны часто сидят рядом так близко, что их хвосты переплетаются, как будто они «держатся за руки».'
  }
];
	let number = Math.floor(Math.random() * fact.length)
	let factEl = document.getElementById("fact-content")
	   factEl.innerHTML = `
       <h2>Интересный факт</h2>
	   <div class="fact-card">
        <img src="${fact[number].image}" alt="${fact[number].text}">
        <p>${fact[number].text}</p>
      </div>
	   `;
	
}
fact(); 
let newFact = document.getElementById("new-fact")
newFact.addEventListener('click', fact)